* CampVI
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | CampVI
Place Name                            | Camp VI
Geographic Location                   | Central West Greenland
Ice Type                              | Sheet -Main
Data Reference                        | Digitization from published graphic
Data DOI                              | 
Science Reference                     | 
Science DOI                           | 
Date                                  | 1950
Longitude [°E]                        | -48.2625
Latitude [°N]                         | 69.6981
Location source                       | Heuberger1954
Depth of top measurement [m]          | 4.0
Depth of bottom measurement [m]       | 125.0
Ice thickness [m]                     | 1389.0
Coverage [% of thickness]             | 9
Ice thickness source                  | BedMachine_V3
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ Lüthi Pers. comm.

#+BEGIN_example
From: Martin Luethi
To: Ken Mankoff
Subject: Re: TD5 from Thomsen 1991
Date: Thu 01 Oct 2020 02:27:19 PM PDT
Attachments: [1]thompson_profiles.zip(2.9M)

Ken Mankoff writes:
>> I'm looking for the source of the TD5 temperature profile you show in
>> your 2015 "Heat sources" paper in The Cryosphere. Your Figure 2 shows
>> TD5 and your text references Thomsen et al. 1991, and Thomsen &
>> Thorning, 1992.

Good questions. I probably don't have these papers, but I have some of
the profiles. I got them as paper copies from Heinz Blatter, and later
also some of them from Thomas Phillips. It's been a while, so I don't
have any details.

I also added some data from profiles I found in EGIG publications. 
#+END_example

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|   d |      t |
|   4 | -12.85 |
|   5 | -12.78 |
|   6 | -12.65 |
|   7 | -12.62 |
|   8 | -12.45 |
|   9 | -12.32 |
|  10 | -12.28 |
|  11 |  -12.3 |
|  12 | -12.28 |
|  13 | -12.32 |
|  14 | -12.38 |
|  15 | -12.45 |
|  20 |  -12.9 |
|  30 | -13.42 |
|  40 |  -13.9 |
|  50 | -14.32 |
|  55 | -14.52 |
|  60 | -14.72 |
|  62 | -14.81 |
|  65 | -14.88 |
|  70 | -15.05 |
|  80 | -15.35 |
|  85 | -15.48 |
|  90 | -15.65 |
| 100 | -15.85 |
| 105 |  -16.0 |
| 110 |  -16.1 |
| 115 | -16.22 |
| 120 | -16.32 |
| 123 |  -16.4 |
| 125 | -15.42 |
